ezois_ka/oooezoiskaobmen/src/Catalogs/РабочиеМестаОхраныТруда/РабочиеМестаОхраныТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМестаОхраныТруда</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияТруда</name>
    <type>
      <types>CatalogRef.УсловияТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеРабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаОхраныТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетУсловиямТруда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</name>
    <type>
      <types>EnumRef.ВидыРаботСДосрочнойПенсией</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДосрочногоНазначенияПенсии</name>
    <type>
      <types>CatalogRef.ОснованияДосрочногоНазначенияПенсии</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияТрудаПФР</name>
    <type>
      <types>CatalogRef.ОсобыеУсловияТрудаПФР</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПозицииСпискаПФР</name>
    <type>
      <types>CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыплачиваетсяНадбавкаЗаВредность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНадбавкиЗаВредность</name>
    <comment>АПК:58 различия имени и синонима оправданы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДополнительногоОтпускаВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерВыполняемыхРаботПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныеДокументыПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВредныеФакторыСопоставлены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НормыСИЗСоответствуютДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальноеРабочееМестоДляИнвалидов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/Catalogs/РабочиеМестаОхраныТруда/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		ВызватьИсключение НСтр("ru='Группы рабочих мест создаются автоматически'");
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.РабочиеМестаОхраныТруда") Тогда
		ИменаРеквизитов = "Владелец,
						  |Подразделение,
						  |Должность,
						  |ВАрхиве";
		СведенияОснования = РабочиеМестаОхраныТруда.ЗначенияВзносовВредностиПФР(ДанныеЗаполнения, ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СведенияОснования);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
		ИменаРеквизитов = "Владелец,
						  |Подразделение,
						  |Должность,
						  |Закрыта";
		СведенияОснования = РабочиеМестаОхраныТруда.ЗначенияВзносовВредностиПФР(ДанныеЗаполнения, ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СведенияОснования);
		ВАрхиве = СведенияОснования.Закрыта;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("ДолжностьПоШтатномуРасписанию") Тогда
			Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ДанныеЗаполнения.ДолжностьПоШтатномуРасписанию, "Должность");
		ИначеЕсли ДанныеЗаполнения.Свойство("Должность") Тогда
			Должность = ДанныеЗаполнения.Должность;
		КонецЕсли;
		НазначитьНомер();
		Наименование = РабочиеМестаОхраныТруда.НаименованиеРабочегоМеста(Подразделение, Должность, Номер);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ОбъектКопирования.ЭтоГруппа Тогда
		ВызватьИсключение НСтр("ru='Группы рабочих мест создаются автоматически'");
	КонецЕсли;
	
	НазначитьНомер();
	Наименование = РабочиеМестаОхраныТруда.НаименованиеРабочегоМеста(Подразделение, Должность, Номер);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗанятостьНомераРабочегоМеста();
	
	УстановитьПривилегированныйРежим(Истина);
	СоздатьГруппуРабочегоМеста();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПроверитьНазначениеРабочегоМестаСотрудникам(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоУсловиямТруда(УсловияТруда, ДанныеУсловийТруда = Неопределено) Экспорт
	
	Если ДанныеУсловийТруда = Неопределено Тогда
		ДанныеУсловийТруда = РабочиеМестаОхраныТруда.ЗначенияВзносовВредностиПФР(УсловияТруда);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеУсловийТруда);
	
	СоответствуетУсловиямТруда = Истина;
	
КонецПроцедуры

Процедура ПроверитьЗанятостьНомераРабочегоМеста()
	
	СОУТИспользуется = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда") Тогда
		МодульОхранаТруда = ОбщегоНазначения.ОбщийМодуль("ОхранаТруда");
		СОУТИспользуется = МодульОхранаТруда.СпециальнаяОценкаУсловийТрудаИспользуется(Владелец);
	КонецЕсли;
	
	Если Не СОУТИспользуется Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗанятогоРабочегоМеста = Новый Структура;
	ДанныеЗанятогоРабочегоМеста.Вставить("Номер", "");
	ДанныеЗанятогоРабочегоМеста.Вставить("РабочееМесто", Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда"));
	
	Если Не Справочники.РабочиеМестаОхраныТруда.НомерРабочегоМестаЗанят(ЭтотОбъект, Ссылка, ДанныеЗанятогоРабочегоМеста) Тогда
		Возврат;
	КонецЕсли;
	
	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Номер %1 уже установлен в рабочем месте %2.'"),
		ДанныеЗанятогоРабочегоМеста.Номер, ДанныеЗанятогоРабочегоМеста.РабочееМесто);
	
КонецПроцедуры

Процедура СоздатьГруппуРабочегоМеста() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РабочиеМеста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМеста
		|ГДЕ
		|	РабочиеМеста.Владелец = &Владелец
		|	И РабочиеМеста.Подразделение = &Подразделение
		|	И РабочиеМеста.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Родитель = Справочники.РабочиеМестаОхраныТруда.ПолучитьСсылку();
		
		ГруппаРодитель = Справочники.РабочиеМестаОхраныТруда.СоздатьГруппу();
		ГруппаРодитель.Владелец = Владелец;
		ГруппаРодитель.Подразделение = Подразделение;
		ГруппаРодитель.Наименование = Строка(ГруппаРодитель.Подразделение);
		ГруппаРодитель.УстановитьСсылкуНового(Родитель);
		ГруппаРодитель.Записать();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Родитель = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНазначениеРабочегоМестаСотрудникам(Отказ)

	Если Ссылка.Пустая() Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления, ВАрхиве");
	Если Не ((ПометкаУдаления И Не ДанныеРабочегоМеста.ПометкаУдаления) Или (ВАрхиве И Не ДанныеРабочегоМеста.ВАрхиве)) Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.КадровыеДанные = "РабочееМестоОхраныТруда";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы, "ДатаУвольнения", "=", "ДАТАВРЕМЯ(1, 1, 1)");
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы, "РабочееМестоОхраныТруда", "=", Ссылка);
	
	ПараметрыПолучения.Организация = Владелец;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ПараметрыПолучения.Подразделение = Подразделение;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	УстановитьПривилегированныйРежим(Ложь);
	
	КоличествоСотрудников = СотрудникиОрганизации.Количество();
	Если КоличествоСотрудников > 0 Тогда 
		ТекстКоличествоСотрудников = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 сотруднику;;%1 сотрудникам;%1 сотрудникам;%1 сотрудникам'"),
			КоличествоСотрудников);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Рабочее место назначено %1: %2. Назначенное рабочее место не может быть помечено на удаление или отмечено как неиспользуемое.'"),
			ТекстКоличествоСотрудников, ТекстФИОСотрудников(КоличествоСотрудников, СотрудникиОрганизации));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект.ВАрхиве", "ВАрхиве", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстФИОСотрудников(Знач КоличествоСотрудников, Знач СотрудникиОрганизации)
	
	СотрудниковВключено = 0;
	ЧастиНадписи = Новый Массив;
	Для Каждого СтрокаСотрудник Из СотрудникиОрганизации Цикл
		Если СотрудниковВключено = 3 Тогда
			Прервать;
		КонецЕсли;
		ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(СтрокаСотрудник.Сотрудник));
		ЧастиНадписи.Добавить(ФамилияИнициалы);
		СотрудниковВключено = СотрудниковВключено + 1;
	КонецЦикла;
	ТекстФИОСотрудников = СтрСоединить(ЧастиНадписи, ", ");
	
	ЕщеОсталось = КоличествоСотрудников - СотрудниковВключено;
	Если ЕщеОсталось > 0 Тогда
		ТекстФИОСотрудников = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 и еще %2'"), 
			ТекстФИОСотрудников, ЕщеОсталось);
	КонецЕсли;
	
	Возврат ТекстФИОСотрудников;

КонецФункции	

Процедура НазначитьНомер()
	
	ПорядковыйНомер = Справочники.РабочиеМестаОхраныТруда.МаксимальныйНомерРабочегоМеста(Владелец, Подразделение) + 1;
	Номер = СтрЗаменить(Строка(ПорядковыйНомер), Символы.НПП, "");

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
